# Check Sakila

In [1]:
import duckdb

with duckdb.connect("data/sakila.duckdb") as conn:
    description = conn.sql("DESC;").df()
description

,database,schema,name,column_names,column_types,temporary
0,sakila,main,actor,"[actor_id, first_name, last_name, last_update]","[DOUBLE, VARCHAR, VARCHAR, TIMESTAMP]",False
1,sakila,main,address,"[address_id, address, address2, district, city...","[BIGINT, VARCHAR, VARCHAR, VARCHAR, BIGINT, VA...",False
2,sakila,main,category,"[category_id, name, last_update]","[BIGINT, VARCHAR, TIMESTAMP]",False
3,sakila,main,city,"[city_id, city, country_id, last_update]","[BIGINT, VARCHAR, BIGINT, TIMESTAMP]",False
4,sakila,main,country,"[country_id, country, last_update]","[BIGINT, VARCHAR, TIMESTAMP]",False
5,sakila,main,customer,"[customer_id, store_id, first_name, last_name,...","[BIGINT, BIGINT, VARCHAR, VARCHAR, VARCHAR, BI...",False
6,sakila,main,customer_list,"[ID, name, address, zip_code, phone, city, cou...","[BIGINT, VARCHAR, VARCHAR, VARCHAR, VARCHAR, V...",False
7,sakila,main,film,"[film_id, title, description, release_year, la...","[BIGINT, VARCHAR, VARCHAR, VARCHAR, BIGINT, BI...",False
8,sakila,main,film_actor,"[actor_id, film_id, last_update]","[BIGINT, BIGINT, TIMESTAMP]",False
9,sakila,main,film_category,"[film_id, category_id, last_update]","[BIGINT, BIGINT, TIMESTAMP]",False
10,sakila,main,film_list,"[FID, title, description, category, price, len...","[BIGINT, VARCHAR, VARCHAR, VARCHAR, DOUBLE, BI...",False
11,sakila,main,film_text,"[film_id, title, description]","[BIGINT, VARCHAR, VARCHAR]",False
12,sakila,main,inventory,"[inventory_id, film_id, store_id, last_update]","[BIGINT, BIGINT, BIGINT, TIMESTAMP]",False
13,sakila,main,language,"[language_id, name, last_update]","[BIGINT, VARCHAR, TIMESTAMP]",False
14,sakila,main,payment,"[payment_id, customer_id, staff_id, rental_id,...","[BIGINT, BIGINT, BIGINT, BIGINT, DOUBLE, TIMES...",False
15,sakila,main,rental,"[rental_id, rental_date, inventory_id, custome...","[BIGINT, TIMESTAMP, BIGINT, BIGINT, TIMESTAMP,...",False
16,sakila,main,sales_by_film_category,"[category, total_sales]","[VARCHAR, DOUBLE]",False
17,sakila,main,sales_by_store,"[store_id, store, manager, total_sales]","[BIGINT, VARCHAR, VARCHAR, DOUBLE]",False
18,sakila,main,staff,"[staff_id, first_name, last_name, address_id, ...","[BIGINT, VARCHAR, VARCHAR, BIGINT, BLOB, VARCH...",False
19,sakila,main,staff_list,"[ID, name, address, zip_code, phone, city, cou...","[BIGINT, VARCHAR, VARCHAR, VARCHAR, VARCHAR, V...",False
20,sakila,main,store,"[store_id, manager_staff_id, address_id, last_...","[BIGINT, BIGINT, BIGINT, TIMESTAMP]",False

# Restore data in dfs dictionary and Registering

In [2]:
dfs = {}

with duckdb.connect("data/sakila.duckdb") as conn:
    for name in description['name']:
        if name[0] != '_':
            dfs[name] = conn.sql(f"FROM sakila.{name};").df()

            duckdb.register(name, dfs[name])

dfs['actor'].head()

   actor_id first_name     last_name         last_update
0       1.0   PENELOPE       GUINESS 2021-03-06 15:51:59
1       2.0       NICK      WAHLBERG 2021-03-06 15:51:59
2       3.0         ED         CHASE 2021-03-06 15:51:59
3       4.0   JENNIFER         DAVIS 2021-03-06 15:51:59
4       5.0     JOHNNY  LOLLOBRIGIDA 2021-03-06 15:51:59

In [3]:
duckdb.sql("DESC;").df()

,database,schema,name,column_names,column_types,temporary
0,temp,main,actor,"[actor_id, first_name, last_name, last_update]","[DOUBLE, VARCHAR, VARCHAR, TIMESTAMP]",True
1,temp,main,address,"[address_id, address, address2, district, city...","[BIGINT, VARCHAR, ""NULL"", VARCHAR, BIGINT, VAR...",True
2,temp,main,category,"[category_id, name, last_update]","[BIGINT, VARCHAR, TIMESTAMP]",True
3,temp,main,city,"[city_id, city, country_id, last_update]","[BIGINT, VARCHAR, BIGINT, TIMESTAMP]",True
4,temp,main,country,"[country_id, country, last_update]","[BIGINT, VARCHAR, TIMESTAMP]",True
5,temp,main,customer,"[customer_id, store_id, first_name, last_name,...","[BIGINT, BIGINT, VARCHAR, VARCHAR, VARCHAR, BI...",True
6,temp,main,customer_list,"[ID, name, address, zip_code, phone, city, cou...","[BIGINT, VARCHAR, VARCHAR, VARCHAR, VARCHAR, V...",True
7,temp,main,film,"[film_id, title, description, release_year, la...","[BIGINT, VARCHAR, VARCHAR, VARCHAR, BIGINT, BI...",True
8,temp,main,film_actor,"[actor_id, film_id, last_update]","[BIGINT, BIGINT, TIMESTAMP]",True
9,temp,main,film_category,"[film_id, category_id, last_update]","[BIGINT, BIGINT, TIMESTAMP]",True
10,temp,main,film_list,"[FID, title, description, category, price, len...","[BIGINT, VARCHAR, VARCHAR, VARCHAR, DOUBLE, BI...",True
11,temp,main,film_text,"[film_id, title, description]","[BIGINT, ""NULL"", ""NULL""]",True
12,temp,main,inventory,"[inventory_id, film_id, store_id, last_update]","[BIGINT, BIGINT, BIGINT, TIMESTAMP]",True
13,temp,main,language,"[language_id, name, last_update]","[BIGINT, VARCHAR, TIMESTAMP]",True
14,temp,main,payment,"[payment_id, customer_id, staff_id, rental_id,...","[BIGINT, BIGINT, BIGINT, BIGINT, DOUBLE, TIMES...",True
15,temp,main,rental,"[rental_id, rental_date, inventory_id, custome...","[BIGINT, TIMESTAMP, BIGINT, BIGINT, TIMESTAMP,...",True
16,temp,main,sales_by_film_category,"[category, total_sales]","[VARCHAR, DOUBLE]",True
17,temp,main,sales_by_store,"[store_id, store, manager, total_sales]","[BIGINT, VARCHAR, VARCHAR, DOUBLE]",True
18,temp,main,staff,"[staff_id, first_name, last_name, address_id, ...","[BIGINT, VARCHAR, VARCHAR, BIGINT, ""NULL"", VAR...",True
19,temp,main,staff_list,"[ID, name, address, zip_code, phone, city, cou...","[BIGINT, VARCHAR, VARCHAR, ""NULL"", VARCHAR, VA...",True
20,temp,main,store,"[store_id, manager_staff_id, address_id, last_...","[BIGINT, BIGINT, BIGINT, TIMESTAMP]",True

In [4]:
duckdb.sql("FROM actor SELECT first_name, last_name LIMIT 5;").df()

  first_name     last_name
0   PENELOPE       GUINESS
1       NICK      WAHLBERG
2         ED         CHASE
3   JENNIFER         DAVIS
4     JOHNNY  LOLLOBRIGIDA